In [62]:
import pandas as pd

customers = pd.read_csv("./data/addresses.csv")

print(customers.shape)
print(customers.head())

(100000, 3)
   company_id                                            address  total_spend
0           1  APARTMENT 2,\n52 BEDFORD ROAD,\nLONDON,\nENGLA...         5700
1           2           107 SHERINGHAM AVENUE,\nLONDON,\nN14 4UJ         4700
2           3  43 SUNNINGDALE,\nYATE,\nBRISTOL,\nENGLAND,\nBS...         5900
3           4  HAWESWATER HOUSE,\nLINGLEY MERE BUSINESS PARK,...         7200
4           5  AMBERFIELD BARN HOUSE AMBER LANE,\nCHART SUTTO...         4600

## INVESTIGATING MISSING VALUES

In [64]:
customers.isnull().sum()

company_id       0
address        968
total_spend      0
dtype: int64

In [65]:
## drop null records
customers = customers.dropna(subset=["address"])

check if our total_spend col-umn contains any strange values

In [67]:
customers["total_spend"].describe()

count    99032.000000
mean      4951.673197
std       1500.642398
min          0.000000
25%       3900.000000
50%       5000.000000
75%       6000.000000
max      11700.000000
Name: total_spend, dtype: float64

## EXTRACTING CITY COLUMN FROM ADDRESSES

In [69]:
for address in customers["address"].head():
    print(address, "\n")

APARTMENT 2,
52 BEDFORD ROAD,
LONDON,
ENGLAND,
SW4 7HJ

107 SHERINGHAM AVENUE,
LONDON,
N14 4UJ

43 SUNNINGDALE,
YATE,
BRISTOL,
ENGLAND,
BS37 4HZ

HAWESWATER HOUSE,
LINGLEY MERE BUSINESS PARK,
LINGLEY GREEN AVENUE,
GREAT SANKEY, WARRINGTON,
WA5 3LP

AMBERFIELD BARN HOUSE AMBER LANE,
CHART SUTTON,
MAIDSTONE,
ENGLAND,
ME17 3SF

for filter address contain "â€œLondon,". Dataset address show as uppercase letter. we need to make sure all address is in uppercase. We create new address column with uppercase letter.

In [71]:
customers["address_clean"] = customers["address"].str.upper()
customers.head()

,company_id,address,total_spend,address_clean
0,1,"APARTMENT 2,\n52 BEDFORD ROAD,\nLONDON,\nENGLA...",5700,"APARTMENT 2,\n52 BEDFORD ROAD,\nLONDON,\nENGLA..."
1,2,"107 SHERINGHAM AVENUE,\nLONDON,\nN14 4UJ",4700,"107 SHERINGHAM AVENUE,\nLONDON,\nN14 4UJ"
2,3,"43 SUNNINGDALE,\nYATE,\nBRISTOL,\nENGLAND,\nBS...",5900,"43 SUNNINGDALE,\nYATE,\nBRISTOL,\nENGLAND,\nBS..."
3,4,"HAWESWATER HOUSE,\nLINGLEY MERE BUSINESS PARK,...",7200,"HAWESWATER HOUSE,\nLINGLEY MERE BUSINESS PARK,..."
4,5,"AMBERFIELD BARN HOUSE AMBER LANE,\nCHART SUTTO...",4600,"AMBERFIELD BARN HOUSE AMBER LANE,\nCHART SUTTO..."

In [72]:
## we can investigate the difference between looking for "LONDON" and "LONDON,"
len(customers[customers["address_clean"].str.contains("LONDON")])

21768

In [73]:
len(customers[customers["address_clean"].str.contains("LONDON,")])

20831

In [74]:
customers["address_lines"] = ( customers["address_clean"].str.split(",\n").apply(len))

customers["address_lines"].value_counts().sort_index()

address_lines
1        6
2       52
3     3284
4    35850
5    45931
6    13909
Name: count, dtype: int64

We can observe that some addresses consist of only one or two lines

In [76]:
print(customers.loc[customers["address_lines"] == 1, "address_clean"])

17789                      FALKIRK
31897                   HADDINGTON
61750          CREAG BHAITHEACHAIN
75330                     NEWMILNS
78045    REDCLOAK FARM, STONEHAVEN
90897     REFER TO PARENT REGISTRY
Name: address_clean, dtype: object

In [77]:
print((
    customers[customers["address_lines"] == 2].sample(5, random_state = 42) ["address_clean"])
     )

39443                                    FORFAR,\nANGUS
80846                        12 HOPE STREET,\nEDINBURGH
95979    BRANCH REGISTRATION,\nREFER TO PARENT REGISTRY
23563    BRANCH REGISTRATION,\nREFER TO PARENT REGISTRY
81155                             PO BOX 2230,\nGLASGOW
Name: address_clean, dtype: object

In [114]:
cities = pd.read_csv("./data/cities.csv", header=None, names=["city"])
cities.head()

""" here I am checking type because I got an 
 error below the section.   "cities_to_remove = cities[cities['city'].isin(countries_to_remove)].index    that is column name issue"""

print(type(cities)) 
print(cities.columns.tolist()) # See the actual column names

<class 'pandas.core.frame.DataFrame'>
['city']

In [116]:
countries_to_remove = ["England", "Scotland", "Wales", "Northern Ireland"]

print(len(cities))
cities_to_remove = cities[cities['city'].isin(countries_to_remove)].index
cities = cities.drop(index=cities_to_remove)
print(len(cities))

cities = cities["city"].str.replace("*", "", regex=False)
cities["city"] = cities["city"].str.upper()

cities. head()

80
              city
0          England
1             Bath
2      Birmingham*
3        Bradford*
4  Brighton & Hove
76

1               Bath
2         Birmingham
3           Bradford
4    Brighton & Hove
5            Bristol
Name: city, dtype: object